grouper-ws/grouper-ws/doc/xmlExamples/groupDeleteSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:groupDelete xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:wsGroupLookups>
        <ns1:groupName>aStem:test</ns1:groupName>
      </ns1:wsGroupLookups>
      <ns1:actAsSubjectLookup>
        <ns1:subjectId>GrouperSystem</ns1:subjectId>
      </ns1:actAsSubjectLookup>
    </ns1:groupDelete>
  </soapenv:Body>
</soapenv:Envelope>